Tekla Open API Reference for Tekla Structures 2025
ShapeItem.CleanAndModify Method
 Cleans and stores the brep into the shape catalog
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CleanAndModify(
	ref bool isSolid
)
Public Function CleanAndModify (
	ByRef isSolid As Boolean
) As Boolean
Parameters
isSolid
Type: System.Boolean
Parameter indicating if is solid.
Return Value
Type: Boolean
True if cleaning and storing to catalog was successful
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace